computeCurvatureOfSurfInt(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,EdgePntVec!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,TessEpsCntrl!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*,System.Double*,System.Double*)
Given two surfaces and an intersection point and direction vector, compute the
curvature vector and the geodesic curvatures on each surface of the intersection curve
that passes through the specified point in the specified direction. Geodesic curvature
is positive for CCW motion, negative for CW motion (with respect to the surface orientation).
Sides [0] and [1] of input "epv" refer to pSurf0 and pSurf1, respectively.
Each of the two "pGeodCurv" outputs is optional.
Singularities are not handled in this initial implementation (see findSurfIntDirs
for an example of handling surface singularities).
See also computeCurvatureOfFaceInt.